tuanthanhhh/trek-safety-system/Firmware_TRILE/STM32F407_MASTER_LORA/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BTN_K1_Pin GPIO_PIN_3
#define BTN_K1_GPIO_Port GPIOE
#define BTN_K0_Pin GPIO_PIN_4
#define BTN_K0_GPIO_Port GPIOE
#define LED_M1_Pin GPIO_PIN_6
#define LED_M1_GPIO_Port GPIOA
#define LED_M2_Pin GPIO_PIN_7
#define LED_M2_GPIO_Port GPIOA
#define BTN_LEFT_Pin GPIO_PIN_7
#define BTN_LEFT_GPIO_Port GPIOE
#define BTN_RIGHT_Pin GPIO_PIN_9
#define BTN_RIGHT_GPIO_Port GPIOE
#define BTN_SELECT_Pin GPIO_PIN_10
#define BTN_SELECT_GPIO_Port GPIOE
#define LED_03_Pin GPIO_PIN_8
#define LED_03_GPIO_Port GPIOD
#define BUZZER_Pin GPIO_PIN_9
#define BUZZER_GPIO_Port GPIOD
#define LED_02_Pin GPIO_PIN_10
#define LED_02_GPIO_Port GPIOD
#define LED_01_Pin GPIO_PIN_11
#define LED_01_GPIO_Port GPIOD
#define SPI3_CS_Pin GPIO_PIN_0
#define SPI3_CS_GPIO_Port GPIOD
#define SPI3_RST_Pin GPIO_PIN_1
#define SPI3_RST_GPIO_Port GPIOD
#define DIO0_Pin GPIO_PIN_2
#define DIO0_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
